hello_new_user = 'Привет!\n\n🤖 "Студенческий Помощник" — ваш надежный спутник в мире учебы! '
'Этот бот создан для того, чтобы облегчить жизнь студентам. Он быстро отвечает на часто задаваемые '
'вопросы о расписании, экзаменах, учебных материалах и студенческой жизни.\n\n'
'📚 Просто напишите свой вопрос, и получите мгновенный ответ! Будь то информация о дедлайнах, '
'советы по подготовке к экзаменам или ресурсы для изучения — наш бот всегда готов помочь.\n\n'
'🎓 Учитесь с умом и не тратьте время на поиски информации — доверьтесь "Студенческому Помощнику!"'

hello_admin = 'Привет, Админ!'

hello_user = 'Привет! Чем я могу тебе помочь?'

help_about = 'О нас'

home = 'Чем я могу тебе помочь?'
